import React from "react";
import { Container, Row, Col } from "react-bootstrap";

const AboutScreen = () => {
  return (
    <Container className="py-5 about-container" id="page-container">
      <Row>
        <Col sm={7}>
          <div
            style={{
              display: "flex",
              justifyContent: "center",
              alignItems: "center",
              fontFamily: "Kalpurush",
              fontWeight: "500",
              fontSize: "1.2rem",
            }}
            id="content-wrap">
            স্বপ্ন, আবেগ এবং প্রত্যাশার সমন্বয়ের নাম পেন্সিল, যা লক্ষ লক্ষ
            হৃদয়কে আলোকিত করে। পেন্সিলের লক্ষ্য নান্দনিক সমাজ গড়া।
            <br></br>
            <br></br>
            লেখক, গায়ক, চিত্রশিল্পী, আলোকচিত্রশিল্পীসহ ভিন্ন ভিন্ন শ্রেণীর
            সৃজনশীল মানুষ নিয়ে ২০১৬ সালের ১২ সেপ্টেম্বর ফেসবুক গ্রুপ হিসেবে
            পেন্সিল যাত্রা শুরু করে। শিল্প–সংস্কৃতির সুস্থ চর্চাকে প্রজন্ম থেকে
            প্রজন্মে ছড়িয়ে দেয়াই পেন্সিলের লক্ষ্য।
            <br></br>
            <br></br>
            অনলাইন প্লাটফর্ম হিসেবে যাত্রা শুরু করলেও পেন্সিল শুধুমাত্র অনলাইনেই
            নিজেকে সীমাবদ্ধ রাখেনি। অনলাইনের পাশাপাশি পেন্সিলের অফলাইন কার্যক্রম
            এগিয়ে নিতে ইতঃমধ্যেই পেন্সিল ফাউন্ডেশন প্রতিষ্ঠিত হয়েছে। পেন্সিল
            ফাউন্ডেশন পেন্সিলের শক্তিশালী কাঠামোগত পরিচয় বহন করে। পেন্সিল
            ফাউন্ডেশন প্রতিষ্ঠার পাঁচ মাসের মধ্যে ২০১৯ সালের ফেব্রুয়ারী মাসে অমর
            একুশে গ্রন্থমেলায় বাঙ্গালীর স্বাধিকারের চেতনার প্রথম সোপান ভাষা
            আন্দোলন কে সম্মান জানিয়ে পেন্সিল পাবলিকেশনস ‘বই বায়ান্ন’ স্লোগানে
            ৫২টি বই প্রকাশ করে। মুজিব বর্ষ , অমর একুশে গ্রন্থ মেলা ২০২০ এ ১৯৫৪
            সালের প্রাদেশিক নির্বাচনে যুক্তরাষ্টের ঐতিহাসিক স্মারক সংখ্যা
            বিবেচনায় ‘বই চুয়ান্ন’ স্লোগানে পেন্সিল পাবলিকেশনস ৫৪টি বই প্রকাশ
            করে। ২০২১ সালে কোভিডের ভয়াবহ করাল থাবার কারণে অমর একুশে গ্রন্থমেলা ১
            মাস পেছানো হলেও, পেন্সিল পাবলিকেশনস বই প্রকাশ থেকে থেমে থাকেনি। বরং
            ‘বই ছাপ্পান্ন’ স্লোগানে নতুন ৫৬টি বই উপহার নিয়ে এসেছে সবার জন্য।
          </div>
        </Col>
        <Col
          sm={5}
          style={{
            display: "flex",
            justifyContent: "center",
            alignItems: "center",
          }}
        >
          {" "}
          <img
            src={require("../assets/about.png")}
            alt="about pencil"
            className="img-fluid hover-shadow"
          />
        </Col>
      </Row>
    </Container>
  );
};

export default AboutScreen;
